env.localization['definitions'] = {
    // castes 
    "жат": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жата": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жату": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жатом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жате": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },

    "жаты": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жатов": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жатам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жатами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },
    "жатах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'инженер';'каста'" },

                    
    "вел": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "θвела": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "велу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "велом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "веле": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },

    "велы": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "велов": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "велам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "велами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "велах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },


    "тир": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тира": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тиру": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тиром": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тире": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },

    "тиры": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тиров": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тирам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тирами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "тирах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },


    "кив": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "кива": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "киву": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "кивом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "киве": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },

    "кивы": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "кивов": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "кивам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "кивами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },
    "кивах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },

    "куу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'каста';'частичная потеря значения из-за поврежденного контекста'" },


    // ethnicity
    "экивик": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивика": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивику": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиком": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивике": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    
    "экивики": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиков": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивикам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиками": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиках": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },

    "экивиковый": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивикового": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковому": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковым": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },

    "экивиковое": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },

    "экивиковая": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковой": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковую": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковой": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковою": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },

    "экивиковые": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковых": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковым": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },
    "экивиковыми": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'экива'" },


    "вазниец": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийца": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийцу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийцем": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийце": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "вазнийцы": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийцев": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийцам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийцами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийцах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "вазнийка": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийки": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийке": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийку": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийкой": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийкою": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "вазнийки": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазниек": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийкам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийками": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийках": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "вазнийский": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийского": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийскому": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийским": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийском": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "вазнийское": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "вазнийская": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийской": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийскою": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийскую": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "вазнийские": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийских": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийским": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },
    "вазнийскими": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },

    "по-вазнийски": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'подразумевается этнос';'происхождение с континента';'вазни'" },


    // places
    "вазни": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'континент';'дом';'в центре обитаемой зоны'` },
    "тувазу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'заброшенный континент';'известен экзотическими вейльковыми эктопаразитами'` },

    "указни озо": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземный город';'горная крепость';'место происхождения импульсного оружия серое'" },

    "олтазни": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'дом';'вазнийский пещерный город'` },

    "козазни": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'вазнийский пещерный город';'дом казки';'известен грибковыми фермами'` },

    "окизика": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизики": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизике": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизику": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизикой": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизикою": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },

    "окизиковая": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизиковой": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизиковую": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },
    "окизиковою": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": `'экивиковый наземный монумент';'святое место'` },


    // religion
    "велзи": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'бог'" },

    "фея": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "феи": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "фее": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "фею": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "феей": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "феею": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},

    "фей": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "феям": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "феями": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "феях": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},


    // flora and fauna. if that is even applicable to obeski
    "вейльк": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейлька": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльку": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльком": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльке": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },

    "вейльки": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльков": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейлькам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльками": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльках": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },

    "вейльковый": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейлькового": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковому": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковым": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльков": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },

    "вейльковое": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльково": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },

    "вейльковая": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковой": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковую": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковою": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейлькова": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },

    "вейльковые": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковых": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковым": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковыми": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },
    "вейльковы": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'наземная фауна';'основа всей экосистемы';'огромные и нескончаемые'" },


    "сельки": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'вейльковый паразит';'еда'" },

    "секри": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'хищник';'инфекция';'первобытный ужас'" },

    "зузукри": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'агрессивная паразитическая наземная фауна';'захватывает разум жертвы для использования в качестве социального камуфляжа';'экивиковое ругательство'" },


    // shit that just happens on obeski 
    "шпилешторм": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'погодные явления';'нескончаемый бурный шторм вокруг естественного шпиля'` },
    "шпилешторма": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'погодные явления';'нескончаемый бурный шторм вокруг естественного шпиля'` },
    "шпилешторму": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'погодные явления';'нескончаемый бурный шторм вокруг естественного шпиля'` },
    "шпилештормом": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'погодные явления';'нескончаемый бурный шторм вокруг естественного шпиля'` },
    "шпилешторме": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'погодные явления';'нескончаемый бурный шторм вокруг естественного шпиля'` },


    // corru
    "голем": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "голема": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "голему": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "големом": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "големе": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},

    "големы": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "големов": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "големам": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "големами": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},
    "големах": { "type": "ПРИМЕЧАНИЕ", "text": "'частичный перевод';'подразумевается ближайший культурный эквивалент'"},


    "глазика": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "глазики": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "глазике": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "глазику": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "глазикой": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },

    "глазик": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "глазикам": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "глазиками": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "глазиках": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },


    "кальстик": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстика": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстику": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстике": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстиком": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },

    "кальстики": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстиков": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстикам": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстиками": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },
    "кальстиках": { "type": "ПЕРЕВОД НЕ УДАЛСЯ", "text": "ПРИЧИНА:'нет эквивалентного внутреннего значения';'нет уместного унаследованного контекста'::УСПЕШНАЯ КИРИЛЛИЗАЦИЯ" },


    "θокно": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },
    "θокна": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },
    "θокну": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },
    "θокном": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },
    "θокне": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },

    "θокон": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },
    "θокнам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },
    "θокнами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },
    "θокнах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "ПРИМЕЧАНИЕ::'частичный перевод';'подразумевается ближайший культурный эквивалент';'технологический подтекст'" },


    // terminology
    "улыбнётся ему велзи": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'распространённый оборот речи';'субъект веселит бога своими выходками';'религиозный подтекст'` },
    "улыбнётся ей велзи": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'распространённый оборот речи';'субъект веселит бога своими выходками';'религиозный подтекст'` },
    "улыбнётся им велзи": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'распространённый оборот речи';'субъект веселит бога своими выходками';'религиозный подтекст'` },

    "благой взор": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'распространённый оборот речи';'да обернётся на нас благой взор велзи';'пожелания хорошей удачи'` },

    "как воззирает": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'распространённый оборот речи';'религиозный подтекст';'как на тебя воззирает велзи'` },


    "сцена велзи": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'всё, что можно видеть';'физическая реальность';'религиозный термин, ныне используемый в науке';'частичный перевод';'сгенерировано из унаследованного описания'" },
    "сцены велзи": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'всё, что можно видеть';'физическая реальность';'религиозный термин, ныне используемый в науке';'частичный перевод';'сгенерировано из унаследованного описания'" },
    "сцене велзи": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'всё, что можно видеть';'физическая реальность';'религиозный термин, ныне используемый в науке';'частичный перевод';'сгенерировано из унаследованного описания'" },
    "сцену велзи": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'всё, что можно видеть';'физическая реальность';'религиозный термин, ныне используемый в науке';'частичный перевод';'сгенерировано из унаследованного описания'" },
    "сценой велзи": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'всё, что можно видеть';'физическая реальность';'религиозный термин, ныне используемый в науке';'частичный перевод';'сгенерировано из унаследованного описания'" },
    "сценою велзи": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'всё, что можно видеть';'физическая реальность';'религиозный термин, ныне используемый в науке';'частичный перевод';'сгенерировано из унаследованного описания'" },


    "θсмерть": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмерти": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертью": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},

    "θсмертей": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертям": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертями": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертях": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},

    
    "θсмертный": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертного": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертному": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертным": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертном": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертен": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},

    "θсмертное": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертно": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},

    "θсмертная": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертной": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертную": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертною": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертна": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},

    "θсмертные": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертных": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертным": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертными": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},
    "θсмертны": { "type": "ПРИМЕЧАНИЕ", "text": "'подразумевает изменённое состояние проживания'"},


    "землемыслец": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльца": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльцу": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльцем": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльце": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },

    "землемысльцы": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльцев": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльцам": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльцами": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },
    "землемысльцах": { type: `УНАСЛЕДОВАННЫЙ КОНТЕКСТ`, text: `'уважаемый титул';'административная позиция';'частичный перевод';'сгенерировано из унаследованного описания'` },


    // time
    "θтрёхглазого": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text":`'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'` },

    "θглаз": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },
    "θглаза": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },
    "θглазу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },
    "θглазом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },
    "θглазе": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },
    "θглазу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },

    "θглазам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },
    "θглазами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },
    "θглазах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'обороты вокруг глаза велзи';'религиозный подтекст'" },


    "θвзор": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзора": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзору": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзором": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзоре": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },

    "θвзоры": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзоров": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзорам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзорами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },
    "θвзорах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в глазах'" },


    "θподмиг": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмига": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмигу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмигом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмиге": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },

    "θподмиги": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмигов": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмигам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмигами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },
    "θподмигах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны во взорах'" },


    "θмиг": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмига": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмигу": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмигом": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмиге": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },

    "θмиги": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмигов": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмигам": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмигами": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },
    "θмигах": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'отрезок времени';'многочисленны в подмигах'" },

    
    // akizet cyst-specific
    "беспространство": { "type": "ПРИМЕЧАНИЕ", "text": "'реконструктивный перевод';'подразумевает небытие'"},
    "беспространства": { "type": "ПРИМЕЧАНИЕ", "text": "'реконструктивный перевод';'подразумевает небытие'"},
    "беспространству": { "type": "ПРИМЕЧАНИЕ", "text": "'реконструктивный перевод';'подразумевает небытие'"},
    "беспространством": { "type": "ПРИМЕЧАНИЕ", "text": "'реконструктивный перевод';'подразумевает небытие'"},
    "беспространстве": { "type": "ПРИМЕЧАНИЕ", "text": "'реконструктивный перевод';'подразумевает небытие'"},


    "джокзи озо": { "type": "УНАСЛЕДОВАННЫЙ КОНТЕКСТ", "text": "'дом';'крепость на джокзи'" },
}
getLocalizationForPage(true);
env.localization['strings'] = {  
    "https://cor-RU.github.io/cor-RU/cor-RU.js": "hehehehehe",

    "what's up buddy?": "чё как, дружище?",
    "anything else?": "что-нибудь ещё?",
    "what's up?": "чё как?",
    "anything else on your mind?": "что-нибудь ещё на уме?",

    "it looks like you found an incoherence loop... seen this one before. not gonna get anything useful out of this area": "кажись ты сейчас в петле бессвязности... знаю я такое. здесь вряд ли окажется что-то полезное",

    "about this thoughtform": "об этой мыслеформе",

    "'has no unutilized responses'": `'не имеет неиспользованных ответов'`,
    "'has unutilized responses'": `'имеет неиспользованные ответы'`,
    "'previously utilized response'": `'ранее использованный ответ'`,
    "'response not yet utilized'": `'неиспользованный ответ'`,
    "'response leads to unused responses'": `'ответ ведёт к неиспользованным ответам'`,
    "'dynamic response'": `'динамичный ответ'`,


    "greet": "поздороваться",

    "'clearing mindspike buffer'; 'no progress will be lost'": "'очистка буфера мыслекола';'прогресс не будет потерян'",
    "NOTICE::'loading resources';'please wait'": "УВЕДОМЛЕНИЕ::'прогрузка ресурсов';'пожалуйста, подождите'",

    "SPATIAL NAVIGATION": "ПРОСТРАНСТВЕННАЯ НАВИГАЦИЯ",

    // "EXM": "ИЗУЧ",
    // "ACT": "ДЕЙСТ",
    // --- such short letter combinations have a habit of bleeding into places

    "'additional ACT enabled';'rescan": "'доступно дополнительное ДЕЙСТ';'пересканируйте",

    "end chat": "закончить разговор",
    "back": "назад",

    "enter": "войти",

    // all spike notifs

    "attention": "ВНИМАНИЕ",
    "NOTE": "ПРИМЕЧАНИЕ",
    "NOTICE": "УВЕДОМЛЕНИЕ",
    "WARNING": "ПРЕДУПРЕЖДЕНИЕ",
    "ALERT": "ОПОВЕЩЕНИЕ",
    "EXECUTING": "ВЫПОЛНЯЕТСЯ",
    "ERROR": "ОШИБКА",
    "ANALYSIS": "АНАЛИЗ",
    "NAVIGATING::": "НАВИГАЦИЯ::",

    // other spikeadjacent-shit sorry this is poorly organized lmao

    "confirm": "подтвердить",
    "retract": "отменить",

    "skipping ahead...": "перемотка вперёд...",

    "internal log buffer cleared after reaching limit (80) due to attached external record device": "внутренний буфер лога очищен после достижения предела (80) из-за подключенного внешнего устройства записи",

    "refresh": "обновить",
    "'no coherent data'::SUGGEST::'return to hub'": "'нет связных данных'::ПРЕДЛОЖЕНИЕ::'вернуться в хаб'",
    "'aborted'": "'прервано'",
    "'eject'": "'отключение'",
    "'restored partial recent log'": "'частично восстановлен недавний лог'",
    "'retrace';": "'возвращение';",
    "'refresh';": "'обновление';",
    "'data overload';'retracing';'last coherent position'": "'перегрузка данных';'возвращение';'последняя связная позиция'",
    "'unprocessable data';'retracing';'last coherent position'": "'необрабатываемые данные';'возвращение';'последняя связная позиция'",
    "RECONNECTING__": "ПЕРЕПОДКЛЮЧЕНИЕ__",
    "'clearing mindspike cache';'15 seconds';'refresh to cancel'": "'очистка кэша мыслекола';'через 15 секунд';'обновите страницу для отмены'",
    "'clearing mindspike cache';'in ": "'очистка кэша мыслекола';'через ",
    " seconds';'refresh to cancel'": " секунд';'обновите страницу для отмены'",
    "'clearing mindspike cache';'now'": "'очистка кэша мыслекола';'прямо сейчас'",
    "'data imported';'packed data format'": "'данные импортированы';'сжатый формат данных'",
    "'data imported';'string data format'": "'данные импортированы';'строчный формат данных'",
    "'data exported as file'": "'данные экспортированы в виде файла'",
    "'data format invalid';'unable to process'": "'недопустимый формат данных';'невозможно обработать'",
    "reloading": "перезагрузка",
    "'default quality';'set to low'": "'качество по умолчанию';'установлено низкое'",
    "'default quality';'set to regular'": "'качество по умолчанию';'установлено обычное'",
    "'interface size';'set to large'": "'размер интерфейса';'установлен большой'",
    "'interface size';'set to normal'": "'размер интерфейса';'установлен обычный'",
    "'reduced intensity alternatives active'": "'альтернативы пониженной интенсивности включены'",
    "'reduced intensity alternatives inactive'": "'альтернативы пониженной интенсивности выключены'",
    "'gameplay disabled'": "'геймплей выключен'",
    "'gameplay enabled'": "'геймплей включён'",

    "1 mod(s) initialized:": "1 модификация запущена:",
    "2 mod(s) initialized:": "2 модификации запущено:",
    "3 mod(s) initialized:": "3 модификации запущено:",
    "4 mod(s) initialized:": "4 модификации запущено:",
    "mod(s) initialized:": "модификаций запущено",
    "11 mod(s) initialized:": "11 модификаций запущено:",
    "12 mod(s) initialized:": "12 модификаций запущено:",
    "13 mod(s) initialized:": "13 модификаций запущено:",
    "14 mod(s) initialized:": "14 модификаций запущено:",
    "'mods removed';'refresh for clean reinitialization'": "'убраны модификации';'обновите страницу для чистой реинициализации'",
    "'no mods active';'no change rendered": "'нет активных модификаций';'нет изменений'",
    "1 mod(s) automatically initialized:": "1 модификация автоматически запущена:",
    "2 mod(s) automatically initialized:": "2 модификации автоматически запущено:",
    "3 mod(s) automatically initialized:": "3 модификации автоматически запущено:",
    "4 mod(s) automatically initialized:": "4 модификации автоматически запущено:",
    "mod(s) automatically initialized:": "модификаций автоматически запущено:",
    "11 mod(s) automatically initialized:": "11 модификаций автоматически запущено:",
    "12 mod(s) automatically initialized:": "12 модификаций автоматически запущено:",
    "13 mod(s) automatically initialized:": "13 модификаций автоматически запущено:",
    "14 mod(s) automatically initialized:": "14 модификаций автоматически запущено:",

    "'unsaved changes';'attempt again to forfeit current changes'": "'несохранённые изменения';'повторите попытку для отмены текущих изменений'",
    "::'prohibitive incoherence'": "::'запредельная бессвязность'",
    "actual_site_error": "реальная_ошибка_сайта",
    "something actually fucked up (not a part of the story) details are in the log and console": "что-то на самом деле наебнулось (не часть истории), подробности в логе и консоли (алсо сорян но дальше вы по-английски)",

    "master": "ОБЩЕЕ",
    "music": "МУЗЫКА",
    "sfx": "ЗВУКИ",


    "Imported save contains the following auto-loading modifications:": "Импортированное сохранение содержит следующие автоматически загружающиеся модификации:",
    "Remove prior to import?": "Удалить перед импортом?",
    "Please note that some modded data may persist if the log has been heavily altered.": "Обратите внимание, что некоторые изменённые данные могут сохраниться, если лог был существенно изменён.",
    "remove them": "убрать",
    "keep them": "оставить",

    "Realtime log and memory rendering requires GPU hardware acceleration. Your mindspike either lacks a GPU, or hardware acceleration is inactive. Proceeding without resolving this issue will most likely result in pain.": "Для визуализации логов и воспоминаний в реальном времени требуется аппаратное ускорение GPU. В Вашем мыслеколе либо отсутствует GPU, либо аппаратное ускорение неактивно. Продолжение работы без решения этой проблемы, скорее всего, приведет к болезненным последствиям.",
    "To enable hardware acceleration, enter your viewer settings, search for \"hardware\" or find it in the performance/system section, and toggle it on. A restart of the viewer may be necessary.": "Чтобы включить аппаратное ускорение, войдите в параметры Вашего устройства, в \"Система\", в \"Настройки графики\" и включите его (либо воспользуйтесь интернетом для поиска подходящего способа включения аппаратного ускорения). Может потребоваться перезапуск.",
    "i fixed it": "всё работает",
    "i don't care": "мне без разницы",

    "Your neural output (": "Ваш нейронный вывод (",
    ") is currently larger than 1920x1080. Use of a size-limiting adapter is recommended and may be toggled in the SYS menu.": ") превышает размер 1920x1080 в данный момент. Рекомендуется использовать адаптер с ограничением размера, который может быть включён в меню SYS.",
    "You may proceed with this output size, but this is larger than the available input, and you may experience unusual visual or mechanical artifacts.": "Вы можете продолжить работу с этим размером вывода, но он превышает доступный ввод, и вы можете столкнуться с нестандартными визуальными или механическими искажениями",
    "activate adapter": "активировать адаптер",


    "'thoughtform activity detected'::'resources removed'": "'обнаружена мыслеформенная деятельность'::'удалены данные'",

    "unity": "единство",
    "effigy": "эффигия",

    /*moth*/ "this is so weird... i think that's meant to be akizet": "очень странно... я думаю она должна была быть акизет",
    /*moth*/ "but the data here is so messed up i can't really tell what happened to it": "но данные здесь в таком хреновом состоянии что даже не скажешь что с ней приключилось",


    // READOUT NOTIFS AND GATES AND basically locations lol JUST STUFF ITS SUPER POORLY ORGANIZED AGAIN BUT IM NOT CHANGING IT OK


    "__incomplete_thoughtform__": "__НЕПОЛНОЦЕННАЯ_МЫСЛЕФОРМА__",

    "funfriend": "развледруг",

    "proxyfriend": "проксидруг",

    "GATE": "ВРАТА",

    "..__HELLO__..": "..__ПРИВЕТ__..",
    "::HELLO": "::ПРИВЕТ",

    "their_city": "ИХ_ГОРОД",
    "their-city": "их-город",
    "their city": "ИХ ГОРОД",

    "city_surface": "ПОВЕРХНОСТЬ_ГОРОДА",
    "city-surface": "поверхность-города",
    "THEY WATCH": "ОНИ СМОТРЯТ",

    "the_void": "ПУСТОТА",
    "the-void": "пустота",
    "the void": "ПУСТОТА",

    "their_waters": "ИХ_ВОДЫ",
    "their-waters": "их-воды",
    "their waters": "ИХ ВОДЫ",

    "their_vessel": "ИХ_СУДНО",
    "their-vessel": "их-судно",
    "their vessel": "ИХ СУДНО",

    "the_funny_little_room": "ЗАБАВНАЯ_МАЛЕНЬКАЯ_КОМНАТА",
    "first_chat": "ПЕРВАЯ_БЕСЕДА",
    "first-chat": "первая-беседа",
    "the funny little room": "ЗАБАВНАЯ МАЛЕНЬКАЯ КОМНАТА",

    "clemens_romanus": "КЛИМЕНТ_РИМСКИЙ",
    "clemens-romanus": "климент-римский",
    "clemens romanus": "КЛИМЕНТ РИМСКИЙ",

    "our_dull_vessel": "НАШЕ_СУДНО_СЕРОЕ",
    "our-dull-vessel": "наше-судно-серое",
    "our dull vessel": "НАШЕ СУДНО СЕРОЕ",

    
    "the_dull_contrivance": "открытие_серое",
    "the dull contrivance": "открытие серое",

    "the_embassy": "ПОСОЛЬСТВО",
    "the-embassy": "посольство",
    "the embassy": "ПОСОЛЬСТВО",

    "GOLEM_MAINTENANCE": "ОБСЛУЖИВАНИЕ_ГОЛЕМОВ",
    "golem-maintenance": "обслуживание-големов",
    "GOLEM MAINTENANCE": "ОБСЛУЖИВАНИЕ ГОЛЕМОВ",

    "PALE_HALLS": "БЛЕДНЫЕ_КОРИДОРЫ",
    "pale-halls": "бледные-коридоры",
    "PALE HALLS": "БЛЕДНЫЕ КОРИДОРЫ",

    "»é»¯uÂ%S¥(»": "»é»¯уÂ%ЗЙ(»",

    "..__DEPTHS__..": "..__ГЛУБИНЫ__..",
    "depths": "глубины",
    "the_depths": "ГЛУБИНЫ",
    "the depths": "ГЛУБИНЫ",

    "??__HOME": "??__ДОМ",
    "my-beautiful-world": "мой-дивный-мир",
    "my beautiful world": "мой дивный мир",

    "MEMBRANE_LESION": "РАЗРЫВ_В_МЕМБРАНЕ",
    "MEMBRANE LESION": "РАЗРЫВ В МЕМБРАНЕ",
    "MEMBRANE_INCISION": "НАДРЕЗ_МЕМБРАНЫ",
    "MEMBRANE INCISION": "НАДРЕЗ МЕМБРАНЫ",
    "..__CACHE__..": "..__КЭШ__..",
    "cache": "кэш",

    "JOKZI_OZO": "ДЖОКЗИ_ОЗО",
    "jokzi-ozo": "джокзи-озо",

    "::/FRAME/": "::/ОБРАМЛЕНИЕ/",
    "frame": "обрамление",
    
    "gate::gate::?/::G:a;;T:E": "врата::врата::?/::В:р;;АТ:А",
    "gate::gaGATE::te::?/..::G:a;;T:E": "врата::враВРАТА::та::?/..::В:р;;АТ:А",

    "a?-?b?-????-y?s?": "б?-?ез?-????-н?а?",
    "a-b-y-s": "б-ез-н-а",

    "PARASITE PLANE": "ПАРАЗИТНАЯ ПРОЕКЦИЯ",
    "PARASITE_PLANE": "ПАРАЗИТНАЯ_ПРОЕКЦИЯ",
    "p-a-r-s-t-e": "п-а-р-з-и-т",
    "p?a-??r?-???s?-t?e?": "п?а-??р?-???з?-и?т?",

    "UNPROCESSABLE__!!": "ОБРАБОТКА_НЕВОЗМОЖНА __!!",
    "error-unprocessable": "ошибка-обработка-невозможна",

    "__UNKNOWN": "__НЕИЗВЕСТНО",

    "advance log": "продвинуть лог",
        "advance": "продвинуться",


    // MENU

    
    "'irreversible action';'select log EP'": "'необратимое действие';'выбрать эпизод'",
    "'irreversible action';'not advised';'may cause mental distress'": "'необратимое действие';'не рекомендуется';'может вызвать душевные страдания'",
    "NOTICE::'legacy import';'recommend using file management above'": "УВЕДОМЛЕНИЕ::'устаревший метод';'рекомендуется использовать управление файлами выше'",
    "NOTICE::'third-party resources loaded by system';'allows for log modifications'": "УВЕДОМЛЕНИЕ::'сторонние ресурсы, загруженные системой';'позволяют модифицировать логи'",
    "NOTICE::'violation of terms of service';'modification of critical resources';'legally required authorization rejected for more than 730 consecutive days'": "УВЕДОМЛЕНИЕ::'нарушение условий использования';'модификация критически важных ресурсов';'невыполнение требуемой законом авторизации на протяжении более 730 дней подряд'",
    "'join the supporter ko-fi (its like patreon but less evil)'": "'присоединиться к поддержке через ko-fi (как patreon но менее злой)'",
    "'get the soundtrack'": "'получить саундтрек'",
    "'merch!'": "'мерч!'",
    "'view all supporters and contributors'": "'просмотреть всю поддержку'",
    "'88x31 graphic for personal use'": "'88x31 изображение для личного пользования'",

    "proceed": "ПРОДОЛЖИТЬ",

    "moth": "моль",

    "'establishes external contact'": "'установить внешний контакт'",
    "'return to hub';'eject'": "'вернуться в хаб';'отключение'",
    "'review scanned and detected entities'": "'просмотр просканированных и обнаруженных сущностей'",
    "'system management'": "'управление системой'",
    "'influence thoughtspace';'third-party installation'": "'влияние на мыслепространства';'сторонняя установка'",
    "REALITY::'no effect'": "РЕАЛЬНОСТЬ::'не имеет эффекта'",
    "UNITY::'enables additional ACT on responsive thoughtforms'": "ЕДИНСТВО::'добавляет дополнительное ДЕЙСТ на отзывчивых мыслеформах'",
    "HUNGER::'alters perception to tolerate high incoherence';'reveals gaps'": "ГОЛОД::'изменяет восприятие, позволяя выдерживать высокую бессвязность';'выявляет бреши'",
    "RESONANCE::'none within this particular memory segment';'await further repairs'": "РЕЗОНАНС::'не имеется в этом конкретном сегменте вспоминания';'ожидайте дальнейших починок'",
    "RESONANCE::'detected in upcoming memory stream'": "РЕЗОНАНС::'обнаружен в предстоящем потоке памяти'",
    "RESONANCE::'limited'": "РЕЗОНАНС::'ограниченный'",
    
    "GAD": "ГАН",
    "'overcoherency block, exercise caution'": "'блок сверхсвязности, соблюдайте осторожность'",
    "'overcoherency fluctuation'": "'колебание сверхсвязности'",
    "'coherent'": "'связное'",
    "'incoherence fluctuation'": "'колебание бессвязности'",
    "'widespread incoherency, exercise caution'": "'распространённая бессвязность, соблюдайте осторожность'",

    "return": "назад",
    "mindspike data management": "управление данными мыслекола",
    "import file": "импортировать",
    "export file": "экспортировать",
    "select": "выбрать",
    "delete": "удалить",
    "advanced operations": "продвинутые операции",
    "load neural string": "загрузить нейронную строку",
    "import string": "импорт строки",
    "'paste data';'exercise caution'": "'вставка данных';'проявляйте осторожность'",
    "modification url list": "url-лист модификаций",
    "Data URLs should be separated by new lines. Hitting save will manually load and initialize all third party modifications listed. They will be initialized automatically from then on, in order, until removed.": "URL-адреса должны быть разделены новыми строками. Нажатие \"Сохранить\" вручную загрузит и инициализирует все перечисленные модификации. С этого момента они будут инициализироваться автоматически по порядку, пока не будут убраны.",
    "save list": "сохранить",
    "Only import mindspike data and modifications from trusted sources. Illicit data is known to carry dangerous and often lethal thoughtforms. Failure to exercise caution could lead to stroke, chronos misalignment, or worse. By importing any data into your mindspike, you waive all right to medical claims against MINDSCI. For more information, please refer to your license agreement.": "Импортируйте данные и модификации мыслеколов только из надежных источников. Незаконные данные могут нести в себе опасные и часто смертельные мыслеформы. Несоблюдение мер предосторожности может привести к инсульту, временной несоосности или хуже. Импортируя любые данные в Ваш мыслекол, Вы отказываетесь от всех прав на медицинские претензии к MINDSCI. Для получения дополнительной информации см. лицензионное соглашение.",
    "Visual Preferences": "Настройки визуализации",
    "General Quality": "Общее Качество",
    "Lower overall quality of rendering, primarily in spatial environments. Favorable for low performance hardware.": "Понижение общего качества визуализации, в первую очередь в пространственных средах. Предпочтительно для оборудования с низкой производительностью.",
    "low": "Низкое",
    "Regular": "Обычное",
    "Interface Size": "Размер Интерфейса",
    "Altering your interface size preference will change the scale of all text, and scale all menus accordingly.": "Изменение размера интерфейса изменит масштаб всего текста и всех меню соответственно.",
    "large": "Большой",
    "normal": "Обычный",
    "widescreen adapter": "Широкоэкранный Адаптер",
    "For larger than standard rendering output, use of an adapter is recommended.": "Для вывода визуализации большего размера, чем стандартный, рекомендуется использование адаптера.",
    "Changing this setting will reinitialize - you will lose your current position, but not your progress.": "Изменение этого параметра приведет к перезагрузке — Вы сбросите текущую позицию, но не весь прогресс.",
    "control preferences": "Настройки Управления",
    "intensity": "Интенсивность",
    "Activate REDUCED INTENSITY to present alternative options to scenarios involving realtime controls.": "Активируйте ПОНИЖЕННУЮ ИНТЕНСИВНОСТЬ для отображения альтернативных вариантов сценариев, включающих управление в реальном времени.",
    "Reduced Intensity": "Пониженная",
    "Regular Intensity": "Обычная",
    "META::'some gameplay sections use hardware-dependent features and can cause really bad performance on older/non-gaming machines';'activating this lets you pick alternate options in the moment that may run better'": "МЕТА::'некоторые секции геймплея используют аппаратно-зависимые функции и могут привести к очень плохой производительности на старых/неигровых машинах';'активирование этого предоставляет выбор альтернативных вариантов этих секций, которые могут работать лучше'",
    "Gameplay": "Геймплей",
    "Logs of games or game-like experiences may contain inherited context of their rules, allowing for re-interpretive rendering through user input.": "Записи игр или игровых событий могут содержать унаследованный контекст их правил, что позволяет реинтерпретационную визуализацию посредством пользовательского ввода.",
    "This feature is intended for entertainment only, and may result in memory drift if misused. It may be disabled to ensure memories of games do not depart from their true events.": "Эта функция предназначена только для развлечения и может привести к дрейфу памяти при неправильном использовании. Она может быть отключена для гарантии, что воспоминания об играх не отойдут от их реальных событий.",
    "Disable Gameplay": "Выключить",
    "Enable Gameplay": "Включить",
    "META::'this entirely bypasses non-explorative gameplay sections';'very little story is missed in doing so'": "МЕТА::'полностью отключает неисследовательские секции геймплея';'упущение истории минимально'",
    "System Information": "Об этой системе",
    "Mindspike Specifications": "Технические характеристики мыслекола",
    "System Type:": "Тип Cистемы:",
    "Release Candidate": "Релиз-Кандидат",
    "Version:": "Версия:",
    "(SERVICE TERMINATED)": "(ОБСЛУЖИВАНИЕ ПРЕКРАЩЕНО)",
    "Device ID:": "Идентификатор:",
    "Installation Agent:": "Агент Установки:",
    "Luis Forti": "Луис Форти",
    "Installed on:": "Дата Установки:",
    "January 2nd, 2050": "2 Января 2050",
    "core services": "Основные услуги",
    "rendering support": "Поддержка визуализации",
    "mystery shader man has no website sorry but his name is Kazne" : "у загадочного шейдер-мена нет сайта сорян но его зовут Kazne",
    "quality control": "Контроль качества",
    "Active Support Groups": "Активные группы поддержки",
    "'active fundfriend-level ko-fi supporters'": "'активные ko-fi саппортеры уровня fundfriend'",
    "support actions": "способы поддержки",
    "retry service renewal": "Продлить обслуживание",
    "Audiodigital Export": "Аудиоцифровой экспорт",
    "Physical Media": "Физические носители",
    "Additional Credits": "Дополнительные упоминания",
    "Abridged License": "Сокращенная лицензия",
    "META::'epoch identifier of current build publish'": "META::'epoch-идентификатор текущей публикации сборки'",
    "this implant is provided on a permanent 'pre-mortis' b2.5 license, 'as-is', without any express or implied warranty. except as expressly set forth in the extended license, mindsci shall not have any liability for any direct, indirect, incidental, special, exemplary, or consequential damages (including without limitation loss of life), however caused and on any theory of liability, whether in contract, strict liability, or tort (including negligence or otherwise) arising in any way out of the use or the exercise of the implant for non-insured, non-industrial purposes. with regards to external mindspike log manipulation: the entire risk as to the quality and performance of the recollection is with you. should any thoughtform prove defective in any respect, you (not the initial operator responsible for export) assume the cost of any necessary servicing, repair or correction. this disclaimer of warranty constitutes an essential part of this license. under no circumstances and under no legal theory, whether tort (including negligence), contract, or otherwise, shall you, the initial operator, any data editor, or any distributor of mindspike data, or any supplier of any of such parties, be liable to any person for any indirect, special, incidental, or consequential damages of any character including, without limitation, damages for loss of goodwill, work stoppage, implant failure or malfunction, or any and all other commercial damages or losses, even if such party shall have been informed of the possibility of such damages. this limitation of liability does apply to liability for death or personal injury resulting from such party's negligence. finally, for further information regarding usage, liability, limitations, and modification, please refer to the full license.": "этот имплант предоставляется по постоянной лицензии 'pre-mortis' b2.5, 'как есть', без каких-либо явных или подразумеваемых гарантий. за исключением случаев, прямо предусмотренных в расширенной лицензии, mindsci не несет ответственности за любые прямые, косвенные, случайные, особые, показательные или косвенные убытки (включая, помимо прочего, потерю жизни),  как бы они ни были вызваны и по любой теории ответственности, будь то по контракту, строгой ответственности или деликту (включая халатность или иное), возникающие каким-либо образом из-за использования или применения импланта в незастрахованных, непромышленных целях. в отношении внешней манипуляции логов мыслеколов: весь риск относительно качества и производительности воспоминания лежит на вас. если какая-либо мыслеформа окажется дефектной в каком-либо отношении, вы (а не первоначальный оператор, ответственный за экспорт) берете на себя расходы на любое необходимое обслуживание, ремонт или исправление. этот отказ от гарантии является неотъемлемой частью этой лицензии. Ни при каких обстоятельствах и ни при какой правовой теории, будь то деликт (включая халатность), договор или иное, вы, первоначальный оператор, любой редактор данных или любой дистрибьютор данных мыслеколов, или любой поставщик любой из таких сторон, не несете ответственности перед любым лицом за любые косвенные, особые, случайные или косвенные убытки любого характера, включая, без ограничений, убытки от потери деловой репутации, остановки работы, отказа или неисправности имплантата или любые и все другие коммерческие убытки или потери, даже если такая сторона была проинформирована о возможности таких убытков. Это ограничение ответственности не распространяется на ответственность за смерть или телесные повреждения, возникшие в результате халатности такой стороны. Наконец, для получения дополнительной информации об использовании, ответственности, ограничениях и изменениях, пожалуйста, обратитесь к полной лицензии.",


    // what next, moth????????????? the fuck we doing??????????????

    // pre velziebreak
    "it seems like the interview area is preserving memory stream progress, it isn't resetting completely. maybe run it through to its end and see if any neural paths open up in there": "выглядит так, будто интервью продолжает поток памяти, а не сбрасывает его полностью. может стоит довести его до конца и посмотреть не откроются ли там какие ещё нейронные пути",

    "that ship area seemed pretty empty for the amount of data your spike pulled, check it again": "тот корабль показался мне слишком пустым для того количества данных, которое извлёк твой мыслекол. оглядись там ещё раз",

    "i'm seeing a lot of data in the ocean area for what we saw, did you check everything there?": "я вижу ещё целую кучу данных в океане, мы там точно всё проверили?",

    "i'm seeing what could be another place in the orbit thoughtspace, try and track that down": "я вижу что-то выглядящее как другое место в космическом мыслепространстве, попробуй разыскать",

    "think there's a pathway to another thoughtspace you missed, i see something in the non-spatial city area but i couldn't tell you exactly where. seems like it's moving, probably floating around somewhere": "думаю тут есть путь к другому мыслепространству, я вижу что-то в непространственной части города но не могу сказать точно где. похоже оно двигается, наверное просто плавает где-то",

    "pretty sure there's more to the corrucyst in the city area, i'm seeing enough data volume to where it doesn't seem like we saw all of it": "наверняка что-нибудь ещё прячется в городской местности, я вижу достаточный объём данных чтобы подозревать что мы что-то пропустили",

    "what are you asking me for? you just connected, do your thing dude. don't forget, thoughtforms might extend past your field of perception - think of it like 'scrolling'": "о чём ты меня спрашиваешь? мы едва подключились, делай свое дело чел. не забывай, мыслеформы могут выходить за пределы твоего восприятия - думай об этом, словно ты что-то \"прокручиваешь\"",

    // post velziebreak
    "now we just wait for our container-opening tools to arrive. you could take a break if you want to, i'll let you know when i've got the stuff": "теперь мы ждём когда прибудут наши инструменты-открывашки контейнеров. можешь сделать перерыв если хочешь, я дам знать когда всё придёт",

    "it seems like we could use the stuff in the dendritic container to keep the cyst alive, but i have no idea how we could open it without destroying it. check with funfriend and see if it's got any ideas": "похоже мы могли бы воспользоваться тем, что внутри дендритного контейнера, чтобы сохранить цисту живой, но у меня нет ни малейшего понятия как его открыть. спроси развледруга, есть ли у него идеи",

    "well, now we just kill time until my copper tubing order gets here. don't worry, I'll let you know as soon as it's in": "ну-п, теперь мы просто убиваем время до тех пока не придёт заказ на медь. не волнуйся, я дам знать как только его доставят",

    "so that container has 'processed metals'... damn, i was really hoping that'd be our lead. try talking to that funfriend thing in the hub to see if it has any ideas": "так значит в том контейнере \"обработанные металлы\"... блин, так хотелось чтобы это было нашей зацепкой. может спросить ту развледружную штуку в хабе об идеях?",

    "we need to figure out a way to keep this thing alive. maybe try talking to that funfriend thing in the hub to see if it has any ideas": "нам надо разобраться, как сохранить эту штуковину живой. думаю тебе стоит поговорить с той развледружной фигнюшкой, у неё может оказаться пара идеек",

    "there's some really strange activity in that depths thoughtspace, like it's constantly being changed. your mindspike isn't alerting you to it because it's happening like a thousand times a second. look for anything at all in there": "тут чё-то реально странное с глубинами, они как будто постоянно изменяются. твой мыслекол не уведомляет тебя потому что это происходит ну типа тыщу раз в секунду. порыскай там хоть что-нибудь",

    "i saw some activity when you told the vessel to 'dive', something is definitely changing in the ocean. try and find what it is": "тут подскочила активность когда судно серое нырнуло, что-то точно изменилось в океане. попробуй разузнать, что это",

    "well there has to be a reason the dull vessel can move between space and the ocean. there's no way the rogue entity in here would just make a random change like that": "ну, должна ведь быть причина почему судно серое может передвигаться между космосом и океаном. не могла же эта бесконтрольная сущность взять и сделать это просто так",

    "seems like our friend fixed up the pilot cyst... and it offered to move the ship somewhere. why not give that a shot?": "кажись твоя улыбка починила цисту-пилота... и теперь она предлагает переместить судно серое куда-то. почему бы не попробовать?",

    "check the pilot cyst on the ship, i remember there was some garbled data there before": "проверь что там с цистой-пилотом на корабле, я помню там были какие-то искажённые данные",

    "well your spike reported activity in the dull vessel thoughtform, why not check that out? our friend seems to have changed something there": "ну, твой мыслекол сообщил о какой-то деятельности в мыслеформе судна серое, почему бы не разведать там обстановку? твоя таинственная улыбка похоже что-то изменила",

    // ep1
    "if you're talking about this thoughtform, try interacting with akizet--you'll need to be zoomed out": "если ты спрашиваешь об этой мыслеформе, попробуй повзаимодействовать с акизет--для этого нужно отдалиться",

    "seems like we just have to wait for more repairs from funfriend. take a break i guess": "похоже что нам остаётся только ждать починок от развледруга. перерывчик?",

    "definitely talk to funfriend about repairing communications, even if velzie wasn't threatening us it'd still be my first choice": "давай-ка поговорим с развледругом о починке связи, даже без угрозы велзи это было бы моей первой просьбой",

    "i'm reading that there's been some increase in data to the city street area... definitely check that out": "я тут вижу что количество данных в районе городской улицы прибавилось... обязательно загляни туда",

    "there's still more to see at the embassy from what i can see on my end": "насколько я вижу, в посольстве ещё что-то есть",

    "head to the embassy, funfriend said it fixed some of it up for us": "отправляйся в посольство, развледруг сказал что починил там что-то",

    "let's check in with funfriend, see what it thinks of the job we did": "давай проведаем развледруга, узнаем что он думает",

    "still gotta feed the cyst, up to you when you want to go ahead with it but i'd do it now": "надо бы цисту покормить, ты решай когда этим заняться, но как по мне - лучше сейчас",

    // ep2
    "nothing for now, just gotta wait for funfriend <span definition=\"NOTE::'advance log'\">to finish more of the memory</span>": "",

    "just keep working your way through the collapse memory, we've got more to see": "",

    "looks like we're all set with the framing device, go check out the collapse memory again": "",

    "gotta talk to funfriend about installing my framing device": "",

    "let's go check out the embassy, funfriend said it fixed some stuff in there up": "",

    "we gotta see what's new! talk to funfriend, it'll probably tell you what's up": "",

    // ep3
    "we're on the wait again. can't do anything till funfriend fixes <span definition=\"NOTE::'advance log'\">more of the memory</span>": "",

    "just keep looking around in that memory! it looks like the framing device added an <span definition=\"NOTE::'top right when not speaking'\">objectives list</span>, take a look at that": "",

    "there's more to see in the embassy now, let's follow that thread until we can't anymore. it's the single most important event in obesk < - > earth history, imo": "",

    // ep4
    "just chill for now. we either need more memories repaired, or for those new pieces to come in. take a break if you want, <span definition=\"NOTE::'indicates end of current main content';'observe @corruworks for updates'\">i'll let you know</span>": "",

    "we need leverage, remember? something to make us invaluable to the work on this cyst, so they can't just replace us. there's gotta be something <em>outside</em> the embassy, somewhere": "",

    "well, we just need to see everything we can in that last embassy memory. anything else is secondary right now": "",



    // --- safeguards for combat, this is needed so they wont get accidentally translated and output no definition
    "effect-message": "effect-message",
    "message-actions": "message-actions",

    "win": "win",
    "nothing": "nothing",
    "cower": "cower",
    "truly_nothing": "truly_nothing",
    "evade": "evade",
    "skitter": "skitter",
    "malfunction": "malfunction",
    "attack": "attack",
    "akizet_attack": "akizet_attack",
    "eviscerate": "eviscerate",
    "stab": "stab",
    "frenzy": "frenzy",
    "gakvu_attack": "gakvu_attack",
    "countercall": "countercall",
    "destabilize": "destabilize",
    "tozik_attack": "tozik_attack",
    "parasite": "parasite",
    "mend": "mend",
    "optimize": "optimize",
    "miltza_attack": "miltza_attack",
    "spy": "spy",
    "ultra_spy": "ultra_spy",
    "subvert": "subvert",
    "spy_analyze": "spy_analyze",
    "spy_target": "spy_target",
    "drone_strike": "drone_strike",
    "cavik_attack": "cavik_attack",
    "bazruka": "bazruka",
    "bozko_attack": "bozko_attack",
    "cripple": "cripple",
    "guard": "guard",
    "special_guard_all": "special_guard_all",
    "special_guard_all_bonus": "special_guard_all_bonus",
    "shell": "shell",
    "brawl_weak": "brawl_weak",
    "brawl": "brawl",
    "ik_attack": "ik_attack",
    "dullflare": "dullflare",
    "swipe": "swipe",
    "disabler_pulse": "disabler_pulse",
    "foe_stab": "foe_stab",
    "barrier": "barrier",
    "special_limited_carapace": "special_limited_carapace",
    "enemy_shell": "enemy_shell",
    "restore": "restore",
    "special_spy_all": "special_spy_all",
    "special_attack_all": "special_attack_all",
    "special_barrier_allies": "special_barrier_allies",
    "special_strong_barrier_allies": "special_strong_barrier_allies",
    "special_restorative_barrier": "special_restorative_barrier",
    "incoherent_gundown": "incoherent_gundown",
    "special_fullauto": "special_fullauto",
    "special_fullauto_player": "special_fullauto_player",
    "movefriend_attack": "movefriend_attack",
    "special_mass_destabilize": "special_mass_destabilize",
    "special_movefriend_annihilate": "special_movefriend_annihilate",
    "special_archiveshelf_annihilate": "special_archiveshelf_annihilate",
    "incoherent_movefriend": "incoherent_movefriend",
    "windup": "windup",
    "windup_cover": "windup_cover",
    "focused_windup": "focused_windup",
    "hold_aim": "hold_aim",
    "archival_smash": "archival_smash",
    "kivii_grasp": "kivii_grasp",
    "rez": "rez",
    "husk_attack": "husk_attack",
    "husk_attack_weak": "husk_attack_weak",
    "speak": "speak",
    "berserk": "berserk",
    "special_self_destruct": "special_self_destruct",
    "special_dullsummon": "special_dullsummon",
    "special_dullbuff": "special_dullbuff",
    "special_chant": "special_chant",
    "incoherent_golemboss": "incoherent_golemboss",
    "special_steerleft": "special_steerleft",
    "special_steerright": "special_steerright",
    "special_floorit": "special_floorit",
    "sidearm": "sidearm",
    "unfocused_shot": "unfocused_shot",
    "focused_shot": "focused_shot",
    "primary": "primary",
    "secondary": "secondary",
    "daze_lastresort": "daze_lastresort",
    "daze_good": "daze_good",
    "sacrifice": "sacrifice",
    "special_final_sacrifice": "special_final_sacrifice",
    "sacrifice_restore": "sacrifice_restore",
    "ichor_passive_restore": "ichor_passive_restore",
    "surge": "surge",
    "wild_surge": "wild_surge",
    "exploit": "exploit",
    "coordination": "coordination",
    "plot": "plot",
    "special_enact": "special_enact",
    "mad_claw": "mad_claw",
    "revise": "revise",
    "bone_break": "bone_break",
    "special_invite_storm": "special_invite_storm",
    "special_invoke_madness": "special_invoke_madness",
    "special_inversion": "special_inversion",
    "attack_weak": "attack_weak",
    "enforce": "enforce",
    "focused_guard": "focused_guard",
    "spikes": "spikes",
    "siphon": "siphon",
    "bite": "bite",
    "empower": "empower",
    "distraction_weak": "distraction_weak",
    "lesser_wound": "lesser_wound",
    "wound": "wound",
    "wound_lastresort": "wound_lastresort",
    "special_barrier_allies_weak": "special_barrier_allies_weak",
    "special_carapace_allies": "special_carapace_allies",
    "special_judgement": "special_judgement",
    "special_rule": "special_rule",
    "special_chant_mega": "special_chant_mega",
    "husk_attack_rot": "husk_attack_rot",
    "special_sillyspawn": "special_sillyspawn",
    "special_sillybuff": "special_sillybuff",
    "special_wallspawn": "special_wallspawn",
    "special_wallspawn_boat": "special_wallspawn_boat",
    "boat_clw_windup": "boat_clw_windup",
    "special_boat_clw_grab": "special_boat_clw_grab",
    "special_boat_waveattack": "special_boat_waveattack",
    "special_malware_drill": "special_malware_drill",
    "special_malware_rot": "special_malware_rot",
    "special_malware_rewrite": "special_malware_rewrite",
    "special_malware_empower": "special_malware_empower",
    "intrusive_smash": "intrusive_smash",
    "special_intrusive": "special_intrusive",
    "special_intrusive_ally": "special_intrusive_ally",
    "detonate": "detonate",
    "incoherent_mimic": "incoherent_mimic",
    "bomb_plant": "bomb_plant",
    "special_bomb_detonate": "special_bomb_detonate",
    "special_bomb_detonate_victim": "special_bomb_detonate_victim",
    "scene_evade": "scene_evade",
    "scene_akizet_attack": "scene_akizet_attack",
    "scene_frenzy": "scene_frenzy",
    "scene_gakvu_attack": "scene_gakvu_attack",
    "scene_parasite": "scene_parasite",
    "scene_mend": "scene_mend",
    "scene_spy": "scene_spy",
    "scene_bozko_attack": "scene_bozko_attack",
    "scene_guard": "scene_guard",
    "scene_pull": "scene_pull",
    "scene_cavik_attack": "scene_cavik_attack",
    "scene_miltza_attack": "scene_miltza_attack",
    "scene_dullflare": "scene_dullflare",
    "scene_kavruka": "scene_kavruka",
    "scene_satik": "scene_satik",
    "scene_arm_rifle": "scene_arm_rifle",
    "scene_rifle": "scene_rifle",
    "arch_whelm": "arch_whelm",
    "special_arch_support": "special_arch_support",
    "special_arch_harasser_stab": "special_arch_harasser_stab",
    "arch_harasser_stab": "arch_harasser_stab",
    "arch_punch": "arch_punch",
    "arch_bomb": "arch_bomb",
    "arch_bomb_hit": "arch_bomb_hit",
    "special_arch_tele_channel": "special_arch_tele_channel",
    "arch_tele_sweep": "arch_tele_sweep",
    "tele_arch_hulk_rampage": "tele_arch_hulk_rampage",
    "arch_hulk_rampage": "arch_hulk_rampage",
    "arch_pull": "arch_pull",
    "special_archivist": "special_archivist",
    "tele_archivist_rampage": "tele_archivist_rampage",
    "archivist_charge": "archivist_charge",
    "miltza_charge": "miltza_charge",
    "spine_golem_lunge": "spine_golem_lunge",
    "special_tele_splitbeam": "special_tele_splitbeam",
    "splitbeam_hit": "splitbeam_hit",
    "special_heartwall": "special_heartwall",
    "tele_dullflare_evil": "tele_dullflare_evil",
    "scene_dullflare_evil": "scene_dullflare_evil",
    "scene_kivii_grasp": "scene_kivii_grasp",
    "tele_kivii_grasp": "tele_kivii_grasp",
    "special_tele_itzil": "special_tele_itzil",
    "special_tele_kivii": "special_tele_kivii",
    "scene_kivii_smash": "scene_kivii_smash",
    "special_itzka": "special_itzka",
    "scene_bozko_attack_desperation": "scene_bozko_attack_desperation",
    "scene_cavik_attack_desperation": "scene_cavik_attack_desperation",
    "scene_gakvu_attack_desperation": "scene_gakvu_attack_desperation",
    "tele_tendril_swipe": "tele_tendril_swipe",
    "special_tendril_slam": "special_tendril_slam",
    "special_wall_undulate": "special_wall_undulate",
    "special_tele_golemblast": "special_tele_golemblast",
    "tele_enraged_rampage": "tele_enraged_rampage",
    "vekfight_assault": "vekfight_assault",
    "vekfight_rush": "vekfight_rush",
    "special_eye_boss": "special_eye_boss",
    "eyeboss_hit": "eyeboss_hit",
    "special_epicenter": "special_epicenter",
    "vekoa_swipe": "vekoa_swipe",
    "special_vekoa_rush": "special_vekoa_rush",
    "tele_vekoa_rampage": "tele_vekoa_rampage",
}
env.localization['entityDescriptions'] = {
    "gate::their city": `::СОЕДИНИТЕЛЬНАЯ МЫСЛЕФОРМА
::ПУНКТ НАЗНАЧЕНИЯ::'низкоразмерное мыслепространство';'внутреннее'
::УНАСЛЕДОВАННЫЙ КОНТЕКСТ::<span style='color: var(--obesk-color)'>'их мёртвые шпили, символы контроля'</span>`,

    "gate::their waters": `::СОЕДИНИТЕЛЬНАЯ МЫСЛЕФОРМА
::ПУНКТ НАЗНАЧЕНИЯ::'низкоразмерное мыслепространство';'внутреннее'
::УНАСЛЕДОВАННЫЙ КОНТЕКСТ::<span style='color: var(--obesk-color)'>'их огромная внутренняя пустота';'наш неестественный берег';'конец'</span>`,

    "gate::the void": `::СОЕДИНИТЕЛЬНАЯ МЫСЛЕФОРМА
::ПУНКТ НАЗНАЧЕНИЯ::'низкоразмерное мыслепространство';'внутреннее'
::УНАСЛЕДОВАННЫЙ КОНТЕКСТ::<span style='color: var(--obesk-color)'>'обитель <span definition="ПРИМЕЧАНИЕ::УНАСЛЕДОВАННЫЙ КОНТЕКСТ::'подразумевает изменённое состояние проживания'">мертвецов</span>'</span>`,

    "gate::the embassy": `::СОЕДИНИТЕЛЬНАЯ МЫСЛЕФОРМА
::ПУНКТ НАЗНАЧЕНИЯ::'пространственная мыслеформа';'вспоминание'
::УНАСЛЕДОВАННЫЙ КОНТЕКСТ::<span style='color: var(--obesk-color)'>'выступление';'велзи гогочет от восторга'</span>`,

    "our dull vessel": `::ПРОСТРАНСТВЕННАЯ МЫСЛЕФОРМА
::ЯВНОЕ НАЗНАЧЕНИЕ::'вспоминание';'повторяющаяся локация';'изменение состояния мыслеформ'
<span style="color: var(--obesk-color)" definition="АНАЛИЗ::'некоторые элементы обладают предельно низкой связностью'">::ОБНАРУЖЕНА БЕССВЯЗНОСТЬ</span>`,

    'their vessel': `::ПРОСТРАНСТВЕННАЯ МЫСЛЕФОРМА
::НИЗКОРАЗМЕРНАЯ
::ЯВНОЕ НАЗНАЧЕНИЕ::'вспоминание'
<span style="color: var(--obesk-color)" definition="АНАЛИЗ::'множество сущностей с низкой связностью'">::ОБНАРУЖЕНА БЕССВЯЗНОСТЬ</span>
::УНАСЛЕДОВАННЫЙ КОНТЕКСТ::<span style='color: var(--obesk-color)'>'мёртвые судна окружали наш <span class="code">шпиль</span>';'близнецы нашли нас быстро'</span>`,

    "gate::gate::gate::": `::СОЕДИНИТЕЛЬНАЯ МЫСЛЕФОРМА
::ПУНКТ НАЗНАЧЕНИЯ::ОШИБКА::'необрабатываемая сущность'::ВИЗУАЛИЗИРУЕМО
<span style="color: var(--obesk-color)" definition="АНАЛИЗ::'максимальная бессвязность';'визуализация возможна';'не рекомендуется'">::ОШИБКА ОБРАБОТКИ</span>`,

    "membrane incision": `::КОРРУЦИСТОЗНЫЙ КОМПОНЕНТ
::<span definition="ПРИМЕЧАНИЕ::'пробел в визуализации';'указывает на повреждение нервной системы';'пожалуйста, запишитесь на обследование у mindsci'">НЕ СУЩНОСТЬ</span>`,

    "advance log": `::СИСТЕМНЫЙ КОМПОНЕНТ
::ОПОВЕЩЕНИЕ::<span style="color:var(--bright-color)">'текущий лог мыслекола завершён';'статическое окружение сохранено'</span>
::ПРИМЕЧАНИЕ::'состояние лога продвинется вперёд при следующем визите';'используйте ДЕЙСТ:продвинуться, чтобы немедленно перейти к следующему состоянию'`,

    "proxyfriend": `::ОТЗЫВЧИВАЯ МЫСЛЕФОРМА
::ЯВНОЕ НАЗНАЧЕНИЕ::'вспомогательное приложение';'подключён к центральному ассистенту'`,

    "effigy": `::НЕПОЛНОЦЕННАЯ МЫСЛЕФОРМА
::ЯВНОЕ НАЗНАЧЕНИЕ::'вспоминание'
<span style="color: var(--obesk-color)" definition="АНАЛИЗ::'нет связности';'деформированная сущность';'возможные следы вмешательства'">::ОБНАРУЖЕНА БЕССВЯЗНОСТЬ</span>
::УНАСЛЕДОВАННЫЙ КОНТЕКСТ::<span style='color: var(--bright-color)'>'изабель! изабель! изабель!'</span>`
}


// - DIALOGUES - //
env.localization.dialogues["++epselect"] = generateDialogueObject(`
start
    sys
        ВНИМАНИЕ::'выбор любого эпизода сбросит текущий прогресс'
        РЕКОМЕНДАЦИЯ::'экспортируйте сохранение до выбора эпизода'
        РЕКОМЕНДАЦИЯ::'подтвердите намерение ниже'
    
    RESPONSES::self
        продолжить, потеря текущего прогресса не проблема<+>proceed
            HIDEREAD::
        неважно, я хочу сохранить текущий прогресс<+>END

proceed
    sys
        ЗАПРОС_ПОЛЬЗОВАТЕЛЮ::'выбор лога'

    RESPONSES::sys
        эпизод 0<+>END
            EXEC::cutscene(true);setTimeout(()=>deleteSave(), 1000)
            FAKEEND::(загрузить EP0)
        эпизод 1<+>END
            EXEC::mountSave(GlobalSaves.ep1start)
            FAKEEND::(загрузить EP1)
        эпизод 2<+>END
            EXEC::mountSave(GlobalSaves.ep2start)
            FAKEEND::(загрузить EP2)
        эпизод 3<+>END
            EXEC::mountSave(GlobalSaves.ep3start)
            FAKEEND::(загрузить EP3)
        эпизод 4<+>END
            EXEC::mountSave(GlobalSaves.ep4start)
            FAKEEND::(загрузить EP4)
    
    RESPONSES::self
        неважно, я хочу сохранить текущий прогресс<+>END
`)
env.localization.dialogues["menu_hub"] ={
    start: {
        name: "start",
        body: [
            {
                actor: "sys",
                text: "ЗАПРОС ПОЛЬЗОВАТЕЛЮ::'намерение'"
            },
        ],

        responses: [
            {
                name: "self",
                replies: [
                    {
                        name: 'вернуться в хаб',
                        destination: 'EXEC::endDialogue()',
                        hideRead: true,
                        exec: ()=>{
                            cutscene(true)
                            corruRefresh('/hub/', 3000)
                            if(env.e3a2) env.e3a2.clearWarningListener()
                            setTimeout(()=>{
                                readoutAdd({message: `EXECUTING::'retrace';'localhost'`, name:"sys"})
                            }, 1000)
                        }
                    },
                    {
                        name: 'отключиться',
                        destination: 'EXEC::endDialogue()',
                        hideRead: true,
                        exec: ()=>{
                            cutscene(true)
                            corruRefresh('/', 3000)
                            if(env.e3a2) env.e3a2.clearWarningListener()
                            setTimeout(()=>{
                                readoutAdd({message: `EXECUTING::'eject'`, name:"sys"})
                            }, 1000)
                        }
                    },
                    {
                        name: `неважно`,
                        destination: 'END',
                        exec: ()=>{
                            endDialogue()
                            setTimeout(()=> readoutAdd({message: `NOTE::'aborted'`, name:"sys"}), 1000)
                        }
                    }
                ]
            }
        ]
    },
}
env.localization.dialogues.mthglobalresp = generateDialogueObject(`
RESPOBJ::
    RESPONSES::self
        кто...<+>who
        что...<+>what
        почему...<+>why
        что ты думаешь об этом всём?<+>mothep1end
            SHOWIF::[["ep1_end"], ["ENV!!ep3", false]]
        мысли об обвале?<+>ep3thoughts
            SHOWIF::[["ENV!!ep3", true], ["ENV!!ep4", false]]
        мысли об обвале?<+>ep4thoughts
            SHOWIF::"ep4__entrancefinal"
        преимущество получено<+>leverage
            SHOWIF::[["leverageq", true], ["ozo__council-task", true], ["ozo__fairy_intro", true]]
            SHOWONCE::
        это всё<+>CHANGE::++moth
            FAKEEND::(назад)
`)
env.localization.dialogues["++moth"] = {
    end: mothHasUnreadCheck,
    start: {
        name: "start",
        body: [
            {
                actor: "moth",
                text: "чё как, дружище?",
                texec: ()=> {return env.pageHasMothComment()}
            },
        ],
        
        responses: [
            {
                name: "self",
                replies: [
                    {
                        name: ()=>{return processStringTranslation(page.mothChat.startName)},
                        destination: 'EXEC::changeDialogue(page.mothChat.getDest())',
                        showIf: [["EXEC::env.pageHasMothChat()"]],
                        unreadCheck: ()=> checkUnread({destination: "start", arbitrary: true}, page.mothChat.getDest()),
                        class: "changeread",
                    },
                    {
                        name: 'у меня есть вопросы',
                        destination: 'CHANGE::++mothglobal',
                        class: "changeread"
                    },
                    {
                         name: "что делаем дальше?",
                        destination: 'whatnext',
                        hideRead: true
                    },
                    {
                                name: 'я странно себя чувствую',
                        showIf: [["netstat|<", 0]],
                        destination: 'CHANGE::++mothfj'
                    },
                    {
                        name: `вернёмся к делу`,
                        destination: 'END',
                        exec: mothHasUnreadCheck
                    }
                ]
            }
        ]
    },
    whatnext: {
        name: "whatnext",
        body: [
            {
                actor: "moth",
                texec: ()=> {return processStringTranslation(env.dialogues.mthglobalresp.whatnext())}
            },
        ],
        
        responses: [
            {
                name: "self",
                replies: [
                    {
                        name: "понятно",
                        destination: 'CHANGE::++moth',
                        fakeEnd: "(назад)"
                    }
                ]
            }
        ]
    }
}
env.localization.dialogues["++mothglobal"] = generateDialogueObject(`
start
    self
        у меня есть несколько вопросов

    moth
        валяй, я постараюсь ответить
    
    RESPOBJ::mthglobalresp

loop
    RESPOBJ::mthglobalresp

who
    RESPONSES::self
        ты<+>who_you
        акизетеше<+>who_akizetesche
            SHOWIF::"hub__funfriend-purposeq"
        гордон<+>who_gordon
            SHOWIF::[['citystreet__envoy-end']]
        велзи<+>who_velzie
            SHOWIF::[['dullvessel__fixed-how']]
        неважно<+>loop
            FAKEEND::(назад)

who_you
    self
        кто ты?

    moth
        лол
        окей но серьёзно у тебя есть вопросы?

    RESPONSES::self
        наверно<+>loop
            FAKEEND::(назад)

who_akizetesche
    self
        кто - акизетеше?

    moth
        одна из наверно наилучше задокументированных ранних контактов с обесками
        история гласит, она возглавляла команду по исследованию вещи, приведшей обесков сюда
        постоянно давала долгие, подробные интервью о ней, они назвали это 'зов'
        а потом они все пропали через несколько лет после первого контакта
        стрёмная херня
        безумно что эта корруциста смогла продержаться так долго

    RESPONSES::self
        интересно<+>loop
            FAKEEND::(назад)

who_gordon
    self
        кто такой гордон?

    moth
        хороший вопрос
        не могу найти точное совпадение, но он стопудов агент ФБКС
        было бы легче если бы корруциста акизет помнила его лицо по-нормальному
        ещё вернёмся к этому, может мы ухватим его фамилию и будет проще

    RESPONSES::self
        удачи<+>loop
            FAKEEND::(назад)

who_velzie
    self
        кто - велзи?

    moth
        велзи - это что-то типа "божество" на языке обеск
        суть не только в этом но я полагаю ты спрашиваешь о <em>нашем</em> велзи
        ну о том о котором говорила циста-пилот
        вот только когда она упомянула это имя оно не имело никакого контекста
        типа, почему-то слово "велзи" было отделено от своего значения
        не знаю что это за приколы...
        не сомневаюсь она виделась с тем странным лицом
        может быть какой-то мыслеформе ударила бессвязность в голову и она возомнила себя богом

    RESPONSES::self
        странно<+>loop
            FAKEEND::(назад)


what
    RESPONSES::self
        корру<+>what_corru
        корруцисты<+>what_corrucyst
        зов<+>what_thecall
            SHOWIF::[['interview1__firstchat-behonest']]
        улыбающееся лицо<+>what_smile
            SHOWIF::[['hello__sentry-posthello']]
        корруцистозное топливо<+>what_fuel
            SHOWIF::[['hub__funfriend-fuelthanks']]
        глаз велзи<+>what_eye
            SHOWIF::"exm|embassy|unkind eye"
        mindcores<+>what_mindcores
            SHOWIF::"embassy__d3_person_enable-end"
        вейльк<+>what_veilk
            SHOWIF::"exm|embassy|veilk models"
        секри<+>what_secri
            SHOWIF::"embassy__d2_bozkocavik-end"
        маски<+>what_masks
            SHOWIF::"ozo__council-task"
        серое<+>what_dull
            SHOWIF::"ep4__contact"
        ...если эти знания ставят нас под угрозу?<+>what_fbxlist
            SHOWIF::[["ep1_end", true], ["ep4__h2h", false]]
        неважно<+>loop
            FAKEEND::(назад)

what_masks
    self
        что такое маски
    
    moth
        тут ты вступаешь на непаханое поле дружище
        лучшее что я могу разобрать из контекста это что они как инструменты и оружие
        нечто эти мыслеформы каким-то образом высекли из воспоминаний акизет
        у них на самом деле нет физического присутствия, иначе тебе не удалось бы их получить 
        ещё, они прошли прямиком сквозь соединение и конкретно к тебе
        мои машины как будто бы проигнорировали их или вообще не увидели
        наверное мы наткнулись на целую новую сферу науки лол
        мыслеформенная технология или что-то вроде
        что бы это ни было, оно явно за рамками моей квалификации

    RESPONSES::self
        ок<+>loop
            FAKEEND::(назад)

what_secri
    self
        что такое секри?

    moth
        да лааадно, не можешь же ты не знать про <em>секри</em> фильмы
        истинные шедевры сороковых
        бож, надеюсь никто из обесков никогда не видел их, они должно быть такие издевательские
        если ты всерьёз, то это одно из существ о которых я и впрямь немного знаю
        по сути они - сверххищники на обескии
        и как и остальная половина всей фауны на обескии, они так же паразиты
        или какого-то рода грибковая инфекция... мы на самом деле не знаем точно
        а ещё они микроскопические, но вот стоит им заразить какую-нибудь наземную зверюшку или личиночного обеска...
        ну, на руках у нас только устные описания ибо инициатива по обмену не спешила с реконструкциями,
        но по-видимому они могут быстро видоизменять плоть большинства существ и захватывать их мозг, чтобы распространяться дальше
        противные штуки

    RESPONSES::self
        окей<+>loop
            FAKEEND::(назад)

what_eye
    self
        что такое глаз велзи?

    moth
        это образование на газовом гиганте c которым обеския находится в приливном захвате
        по его видимости народ обесков определяет время
        некоторые регионы обескии поклоняются или презирают его в качестве глаза бога
        учитывая насколько темно в их мире,
        и что в небе у них постоянно эта светящаяся штука которая выглядит как глаз,
        неудивительно, что они пришли к такому выводу
        хотя мы на самом деле не знаем, шторм это или что-то ещё
        потому что обески говорят, он светится на равных промежутках времени
        конечно это мог бы быть отражающийся свет их звезды...
        но без картинок или подобного нам остаётся только догадываться

    RESPONSES::self
        понятно<+>loop
            FAKEEND::(назад)

what_veilk
    self
        что такое вейльк?
    
    moth
        они, в принципе, покрывают всю обитаемую поверхность обескии
        типа как трава растёт по всей земле, наверно
        и... они вырастают до размера небоскрёбов...
        они видимо умеют ходить,
        ээ... у них куча ног...
        и когда один из них умирает, целая экосистема образуется вокруг его трупа
        частью которой каким-то образом являются обески
        ...
        сорян, если честно я не так много о них знаю
        экология обескии даже близко не стоит с моей специализацией
        я в основном изучаю корруцистозные штуки и взаимоотношение людей с обесками
        чуть-чуть культуры там и тут
        и не пойми меня неправильно, вейльки очень важны для них в культурном плане,
        практически вся их одежда делается из вейльковой кожи
        и их пещерные города зависят от вейльковых падений для добычи пропитания
        но у нас на самом деле нет хорошего представления о том, как они устроены
        или как они даже выглядят, исключая стилизованные скульптуры

    RESPONSES::self
        окей<+>loop
            FAKEEND::(назад)
        

what_mindcores
    self
        а все обески на самом деле эти странные паукоштуки?

    moth
        не, только куу
        "личиночные" обески проходят через некую процедуру по превращению в них
        нам успели дать несколько описаний прежде чем они отступили
        но все они очень абстрактные, типа...
        "выкарабкиваться сквозь свои рецепторы в mindcore", оставляя "пустой сосуд" на "мирную гибель"
        ничего научного, но они всегда подчёркивали, что это не просто копия
        потом они собирают себе тела из корру чтоб гонять на них
        этим и являются куу-тела

    RESPONSES::self
        а, хорошо<+>loop
            FAKEEND::(назад)

what_corru
    self
        что такое корру?

    moth
        интересное время чтобы задавать такие вопросы, но я тебя не виню
        большинство людей начинают задаваться подобным как только взглянут на него поближе, даже если читали всю документацию
        исключая суп из умных слов а-ля "суперклеточный суперорганизм", что это такое в общей картине пока не то чтобы ясно
        мне довелось прошерстить чуть ли не каждую стенограмму всех когда-либо взятых интервью с обесками, и они вообще не упоминают происхождение корру или то как у них возник симбиоз с ним
        и типа, если "личиночные" обески правда выглядят почти так же как мы, а потом они переходят в корруцистозные тела, то что это значит для нас?
        чёрт знает, сойти с ума можно если думать об этом слишком долго, впрочем сейчас нет времени философствовать

    RESPONSES::self
        понятно<+>loop
            FAKEEND::(назад)

what_corrucyst
    self
        что такое корруцисты?
    
    moth
        довольно общий термин, по сути "корруциста" и "корруцистозный" - универсальные названия для большинства обесковых технологий
        потому что у организма есть тенденция сворачиваться в шарик и образовать твёрдую оболочку прям как у этой цисты
        именно поэтому корруцистозные штуки обычно сферичные, но не обязательно
        например они используют подобный процесс для формирования тел которые используют куу обески
        если ты имеешь в виду что такое сферичные корруцисты, то обычно они выступают в роли хранилищ или вычислительных приборов
    RESPONSES::self
        понятно<+>loop
            FAKEEND::(назад)

what_thecall
    self
        что такое 'зов'?

    moth
        довольно важная часть человеческо-обесковой истории которую нередко упускают из виду
        предположительно, они смогли найти землю только потому что что-то с неё посылало сигнал, улавливаемый их технологией
        поначалу после первого контакта они пытались выяснить, что это такое, и тучу раз говорили об этом
        затем команда акизет пропала и они просто замолчали
        ...а потом случилось всё остальное
        примерно тут всё и пошло наперекосяк
____SHOWIF::"ep4__entrancefinal"
        лол, сейчас это уже больше напоминает только самую верхушку айсберга
____SHOWIF::["ep4__entrancefinal", false]
        может эта корруциста наконец прольёт свет на то что произошло
____END
    RESPONSES::self
        понятно<+>loop
            FAKEEND::(назад)

what_smile
    self
        время от времени я вижу это странное улыбающееся лицо
        что это?
    
    moth
        в логах ничего такого нет, ну если ты не про того челика-ассистента в хабе

    self
        мне кажется, это оно помогло мне войти

    moth
        о, так у тебя оно выглядит как улыбка?
        может быть моя теория о вирусах не так уж плоха
        ну короче, я всё ещё без понятия чем является наш таинственный приятель
        но похоже это 'велзи', смотря по тому что сказала циста-пилот
            SHOWIF::[['dullvessel__fixed-start']]

    RESPONSES::self
        тревожит<+>loop
            FAKEEND::(назад)

what_fuel
    self
        чем является корруцистозное топливо?
    
    moth
        в интервью они всегда говорили что это что-то выращиваемое... 
        большинство теорий сходится на том что это какой-то металлический грибок который корру способно потреблять
        судя по словам равзледруга, они применяют кучу разных металлов для его изготовления
            SHOWIF::[["hub__funfriend-essentialmetalq"]]
        наверно логично что они используют их, но я не представляю себе как это работает
            SHOWIF::[["hub__funfriend-essentialmetalq"]]
    
    RESPONSES::self
        тревожит<+>loop
            FAKEEND::(назад)

what_dull
    self
        что ты знаешь о среде серое?
    
    moth
        о, приятель, для моих разглагольствований о серое нужна моральная подготовка
        мы тут всю ночь просидим
        такое разочарование что мы не так уж и много о ней знаем
        но... если вкратце о том, что мы знаем точно,
        и это всё типа штуки с интервью,
        был да жил один инженер-экивик - сероезковик жат, э, чётотам,
        который открыл что существует как минимум два вида, типа, реальности
        то что они называют сценой велзи - вот эта - и то что они в итоге назвали средой сероезковика
        или просто среда серое
        короче, мы не знаем как именно ему удалось совершить это открытие, но...
        погоди, я слишком много говорю об истории не так ли. я уже вижу как ты на меня смотришь
        окей. правда, серьёзно вкратце,
        мы знаем больше о её истории чем о всех её физических свойствах вместе взятых
        это одна из вещей, которой обески не успели полноценно с нами поделиться до того как всё рухнуло
        а может они просто не хотели
        они успели рассказать, мол, органическая жизнь не может пройти через неё, не будучи уничтоженной,
        однако вот корру без особых проблем выжить может, при условии небольшой подготовки...
        м... что ещё...
        ходит куча безумных теорий о том, чем она является взаправду
        типа паралелльная вселенная, другое "измерение" или нечто такое, но...
        имхо, это уже заходит на территорию какого-то нереалистичного кино
        всё вряд ли так просто
        у нас просто нет средств на какое-либо осмысленное взаимодействие с ней
        и обески больше больше особо не помогают
        единственное что можно сказать с уверенностью это то что физики очень бесятся по этому поводу
        тек-с... думаю, больше ничего полезного я тебе предоставить не могу
        сорянчик
        всё остальное либо запредельно засекречено,
        либо ждёт нас в этой цисте
    
    RESPONSES::self
        хорошо<+>loop
            FAKEEND::(назад)

what_fbxlist
    self
        что если эти знания ставят нас под угрозу?
    
    moth
        да об этом можно не беспокоиться
        ФБКС это тебе не ЦРУ или ФБР
        худшее что может случиться это пара подписей на договорах о неразглашении
        и судя по тому что мы уже увидели, они неизбежны
        но в вечный отпуск они нас не отправят, если ты это имеешь в виду
    
    RESPONSES::self
        хорошо<+>loop
            FAKEEND::(назад)

why
    RESPONSES::self
        ...у меня иногда выходит визуализировать бессвязные места<+>why_beneath
            SHOWIF::"beneath"
        ...никто другой ещё не вовлечён<+>why_involved
            SHOWIF::"ep1_fed"
        ...именно я<+>why_callme
        ...у меня получилось подключиться<+>why_connect
            SHOWIF::[["EXEC::page.dialoguePrefix != \`fbx\`"]]
        ...я понимаю эти мысли<+>why_thoughts
            SHOWIF::[["EXEC::page.dialoguePrefix != \`fbx\`"]]
        ...я слышу музыку<+>why_music
            SHOWIF::[["EXEC::page.dialoguePrefix != \`fbx\`"]]
        неважно<+>loop
            FAKEEND::(назад)

why_beneath
    self
        почему у меня иногда выходит визуализировать бессвязные места?
        например то, которое показалось тебе очень странным

    moth
        ну точно я не скажу, но помнишь мою теорию?
        ты ж на <span definition="ВНУТРЕННИЙ КОНТЕКСТ::'первый выпуск операционной системы мыслекола'">тонге</span>, да? с ней большую часть обработки выполняет твой мозг
        у системы есть проверки чтобы не давать тебе визуализировать бессвязные штуки
        потому что они могут навредить тебе или вызвать <span definition="ВНУТРЕННИЙ КОНТЕКСТ:'изменённое восприятие времени';'признак скорого инсульта'">временную несоосность</span> или и тд и тп
        не то чтобы <em>вот это</em> могло, конечно, оно отличается от человеческой бессвязности
        ну короче--большую часть времени она полагается на то, чтобы твой мозг сам посылал сигналы типа "бля что-то не так", чтобы блокировать бессвязность
        но когда ты входишь во что бы это ни было <em>из</em> уже довольно бессвязного места
        твой мозг как бы уже привык к бессвязности
        типа как тот старый анекдот про лягушку в кипятке, ага?
        ...
        так, просто для ясности, твой мозг не "в кипятке"
        по идее всё, что творится в этих бессвязных областях, для тебя должно быть совершенно нормально
    
    RESPONSES::self
        ладно<+>loop
            FAKEEND::(назад)

why_involved
    self
        почему до сих пор только мы знаем об этом всём?

    moth
        о
        эээ...
        ну, отчёт ещё типа не отдан
        гляди, если мы сами докопаемся до сути всего этого, ты понимаешь насколько огромным событием это будет?
        если я проболтаюсь хоть кому-нибудь о том, что у нас тут за дела, они это выхватят из наших рук
        ...и передадут какому-нибудь высокопоставленному исследователю который пригребёт себе каждую заслугу
        чел, мы можем добиться такого успеха

    self
        разве здесь нет камер? что насчёт данных?

    moth
        только не в подвале
        это зона аналоговых устройств, ну или по крайней мере была ей в более загруженные года
        сейчас всё пораспущеннее, но они никогда не меняли что внутри стен
        особенно при том что все подобные находки обычно оказываются пустышками
        так что... пока я не пошлю данные, они их не получат
        пока что ты и я занимаемся этим в одиночку, дружище

    RESPONSES::self
        ок<+>loop
            FAKEEND::(назад)


why_callme
    self
        почему над этим работаю именно я?

    moth
        что, не устраивает роль самого первого человека, которому удалось подключиться к персональной корруцисте?
        шучу. у нас не хватает мыслеколящих подрядчиков из-за той катастрофы с последним обновлением
        боже, я даже представить себе не могу о чём в майндсай только думали лмао, траффик до сих в таком хреновом состоянии
        ты - единственный знакомый мне псих который никогда ничего не обновляет, так что мне показалось ты примешь работу

    RESPONSES::self
        спасибо<+>loop
            FAKEEND::(назад)

why_connect
    self
        почему у меня вышло подключиться так легко?

    moth
        ну если у тебя из головы вылетело, у тебя определённо точно установлен тот патч от фбкс
        обычно мыслеколы просто так не могут такое
        вроде как корруцисты посылают и принимают сигналы практически полностью идентичные нервным
        довольно невероятное совпадение, просто чудо что это вообще работает
        но я не разбираюсь в этом, тебе лучше спросить кого-нибудь в отделе разработчиков

    RESPONSES::self
        ок<+>loop
            FAKEEND::(назад)


why_thoughts
    self
        почему я понимаю эти обесковые мысли?

    moth
        ну смотри, ты тут имеешь дело с сырыми мыслями
        слова, которые ты получаешь от корруцисты - это не то что она буквально думает
        твой мозг просто интерпретирует концепты понятным тебе образом

    RESPONSES::self
        круто<+>loop
            FAKEEND::(назад)


why_music
    self
        почему я иногда слышу музыку?

    moth
        слышишь музыку? дико, но имеет смысл
        некоторые мыслеколящие подрядчики, с которыми мне доводилось работать, говорили похожие вещи когда подключались к корруцистозным устройствам
        моя теория - это какой-то унаследованный контекст из цисты, расплывчатые ощущения которые нельзя перевести в речь
        иногда люди слышат голоса или просто "знают" как себя чувствовать
        твой мозг просто обрабатывает это в наиболее понятном тебе формате
        идей получше у меня нет
        так или иначе, на моей стороне ничего не слышно, просто вывод данных
        тебе нравится?

    RESPONSES::self
        нормально<+>loop
            FAKEEND::(назад)

mothep1end
    self
        что ты думаешь обо всём этом?
        о посольстве, об участии гордона...
    
    moth
        думаю, повышение уровня охраны мы себе точно заработали
        никогда до этого не слышал<блинскиймоль> о внутренних разногласиях у обесков
        у них всегда создавалась такая картинка полной гармонии, несмотря на то что у них на родной планете
        и знаешь, вот про зов...
        я думаю по сути осталось всего пару лет до его "завершения", если всё это - правда
        или... может даже меньше?
        хз у меня голова а не калькулятор
        если сможем в ближайшее время докопаться до всего возможного и донести это начальству...
        ты представить себе можешь, какую славу мы вместе получим?
    
    RESPONSES::self
        тебе не страшно?<+>mothep1afraid
        окей<+>loop
            FAKEEND::(назад)

mothep1afraid
    self
        а ты не боишься того, что произойдёт, когда зов завершится?
        что, если это что-то очень плохое?

    moth
        дааа, немного стрёмно, но...
        мы с тобой пережили слишком много кризисов-"концов света" чтобы этот оказался "настоящим"
        кроме того, что если они даже не смогут его расшифровать?
        типа потому что он слишком большой, или потому что они не записали самое начало...
        типа, если зов понадобится им целиком?
        эй, да и вдруг то что лежит там в океане такое же дружелюбное, как и они все?
        короче... чё-б ни случилось, мы как-нибудь разберёмся
    
    RESPONSES::self
        раз ты так говоришь<+>loop
            FAKEEND::(назад)

ep3thoughts
    self
        что ты думаешь об обвале?
        у тебя вроде были мысли?
    
    moth
        о, да!
        короче, он всегда представлялся мне трагедией
        especially since it was the cap золотого века взаимоотношений между людьми и обесками
        like, truly golden age... but man, looking back at the news from those days makes me so sad
        videos, news, everything, everyone felt like everything was going to change
        and, i mean, things did change, but, i'm talking space age change
        apparently everyone really thought we'd be exploring the stars with the obesk
        like, they'd uplift us, or whatever...
        all right, i'm off topic and i haven't even gotten to the topic yet
        basically:
        when the collapse started happening, people reported some truly strange events with obesk machines
        golems started acting erratically, but never actually hurt anyone
        like, i was watching this video of some annoying vlogger who was trying to interview one near a polygonation spire
        pretty sure it was the one close to new zealand actually
        but right in the middle of him harassing this golem, its face flickers and it nearly falls over
        then, it just starts floating past him, right into the ocean, and disappears beneath the surface
        so the vlogger turns the camera back on his face and he's doing that surprised thumbnail thing they used to do back then
        and in the background, you can see other golems doing it too, 
        just before the spire starts collapsing and everyone has to run
        spooky shit, man... even golems further inland apparently started going for the coast too
        oh, and--there was this article i found, there was this one engineer qou that had an "accident" with a golem
        it didn't say their name, but there was a picture of the aftermath
        they totally minced this golem they were working with, then apologized to everyone and ran off
        it's pretty clear that whatever seized all of their tech had literally zero intent to harm a single human
        so what the hell are these golems attacking the embassy for?
        ...
        all right, i know i'm rambling, but one more thing
        no matter where i looked, even using those new net filter tools,
        after the collapse news cycle settled
        there was not a single mention of akizet or her team anywhere - no photos, videos, nothing
        i mean, sure, a little historical paper here and there, but... well
        i'm a little worried we may not have a whole lot of time left with akizet's memories if this is anything to go by
    
    RESPONSES::self
        ...<+>loop
            FAKEEND::(назад)

ep4thoughts
    self
        что ты думаешь об обвале
        раз мы теперь всё увидели
    
    moth
        i knew they weren't going to just, stop it
        but i had no idea it would get that fucked up
        there were things happening in there that i'm still trying to make sense of
        vekoa choosing to kill qou, when she's from a world where intraspecies murder basically doesn't happen
        not just using her golems, but making monsters with the fucking ceremony thing??
        and could you imagine what would have happened?
        like, if vekoa actually managed to make a dull contrivance?
        assuming it was a temporary contrivance, not like the big one in space,
        the whole embassy, the whole island, it would have just blipped away somewhere
        and nobody would have any idea what happened...
        so they didn't stop the collapse,
        and sure, tozik majorly polluted up the ocean around it,
        but somehow, i think in another world, if they failed-failed,
        things would be much worse
    
    self
        может
        что насчёт метеорита?
        вовлечённости ФБКС?

    moth
        the meteorite, i don't know, that's...
        that's something on a scale that's really hard for me to grasp
        it makes sense, really
        i know this sounds sick but i'm almost not surprised at this point
        it's the only start to an explanation for the call that makes any sense, right?
        where it comes from is some other shit we'll have to figure out
        still, you'd think we would have found it by now, 
        even before the obesk showed up...
        maybe knowing it's there will have a larger impact when i'm trying to fall asleep tonight
        but you know what really freaks me out?
        the FBX involvement
        cause we know that akizet and her team disappeared completely after this
        and now we know for sure that the FBX probably had a hand in sparking the collapse
        dude, if this ever got public, the media would crucify us
        and knowing all that, with how long it's been
        we've totally fallen into <span definition="ВНУТРЕННИЙ КОНТЕКСТ::'программа особого доступа';'sensitive compartmentalized information';'highest classification level'">ПОД</span> territory here
        i'm talking like men in black who don't legally exist rolling up to your apartment type of shit
        i know i said this wouldn't happen but i really wasn't expecting it to get this bad
            SHOWIF::"++mothglobal-what_fbxlist"

    self
        я просто подрядчик
    
    moth
        ага, а ещё мы с тобой теперь знаем об одной из самых опасных частей истории обесков
        this isn't the kind of thing where they'd be happy with just a regular NDA 
        even thinking about what this is going to turn into is making me kinda nauseous
        but... it's not like we can back out now
        and frankly, i don't want to
        because as scary as it is...
        the potential upside here, for us, is crazy
        just be careful, all right? i really mean that
        if this isn't handled right, you don't want to know what happens
    
    RESPONSES::self
        понятно<+>loop
            FAKEEND::(назад)

leverage
    self
        преимущество получено
            EXEC::change("leverage", true)
    
    moth
        а? в каком смысле?
    
    self
        это озо-маско-штуки
        они не просто в цисте
        я чувствую их у себя в голове
    
    moth
        окей, ну, эт не очень хорошо, думаю
        хотя... 
        нет, может быть и хорошо, для наших планов
        я понимаю о чём ты думаешь на самом деле...
        ты в курсе сколько всего пребывает и убывает отсюда без единого результата?
        сколько всего просто выбрасывается в мусорку, на хранилище корруцистозных отходов?
        если твои маски работают на <em>других</em> корруцистах...
        типа, если ты пробираешься туда, куда никто другой не может,
        то вот и наш выигрышный билет
        и нам не то чтобы надо упоминать что эти маски произошли из этой цисты
        слушай - никому ни слова о масках. а я вычеркну это из отчёта
        чел давай прям здесь дадим клятву крови. у меня есть карманный ножик
    
    self
        ок
    
    moth
        ок??
        чел я шучу
        такое не пронесёшь через металлоискатели
        в любом случае, думаю единственное что теперь остается делать это снова ждать
        пока развледруг не починит ещё что-нибудь, или нам принесут ещё чего...
        так что пока расслабимся, хорошо?

    RESPONSES::self
        окей<+>loop
            FAKEEND::(назад)
`)
env.localization.dialogues["++mothfj"] = generateDialogueObject(`
start
    self
        я странно себя чувствую
        там всё нормально?

    moth
        что? в каком смысле странно?
        можешь поподробнее?
    
    self
        не знаю как это описать
        что-то с моей головой

    moth
        ну не знаю может что-то не то на обед было, хз чел
        сомневаюсь что дело в "contact affliction" если это тебя забеспокоило
            SHOWIF::'ep4__contact'
        судя по тому что мы видели, эт бы раньше проявилось
            SHOWIF::'ep4__contact'
        смотря на статы твоей операционки, ГАН уходило в минус
        я знаю что другие мыслекольщики, работающие с корруцистами, сталкивались с проблемами в таком случае

____SHOWIF::['mask', 'hunger']
        вообще, странно, но оно такое с момента активации той маски голода
        причём в глобальном значении ничего подобного нет, это только на твоём устройстве
        попробуй деактивировать её 
____END
    
    RESPONSES::self
        что такое ГАН<+>gad
        окей<+>END

gad
    self
        что это такое
        ГАН

    moth
        что? ты не знаешь?
        ГАН значение, чел
        глобальное амбиентное несходство
        оно у тебя буквально в системной менюшке
        в правом верхнем углу по умолчанию вроде
        ты реально о нём не в курсе?

    self
        ну может пару раз упоминали при мне
        оно никогда не вызывало проблем

    moth
        что ж полагаю оно обычно ни на что особо не влияет
        я просто работаю в странной области где это не так лол
        к счастью для тебя, я знаю историю!
        короче, раньше когда мыслеколы были в разработке а прототипы тестировались
        они начали замечать эти рандомные баги в визуализации и записи
        типа они запускали штуки которые всегда должны выводить одно и то же, но вместо этого получали небольшие отклонения
        майндсай НЕ МОГ выяснить чзх творилась
        так что кто-то установил такой крошечный компонент, чётотам фьортофт - помню ток фамилию
        маленькая фьортофская коробочка пропускает постоянный и предсказуемый сигнал через ввод в ОС, а затем сравнивает вывод
        обыкновенное исправление неполадок, да?
        оказалось - сигнал возвращается изменённым
        и ещё, если тестировались несколько мыслеколов одновременно то на каждом из них были одни и те же изменения
        несмотря на то что они вообще никак не связаны
        типа... речь об "одни и те же на разных концах света"
        когда значение возвращалось более слабым или более сильным,
        отклонения в памяти становились серьёзнее 
        довольно безумно, правда? они так и не выяснили из-за чего это происходило
        так что теперь в каждом мыслеколе есть эта маленькая коробочка замеряющая значение ГАН
        некоторые люди в интернете считают это свидетельством ноосферы...
        но больше популярны теории о том что это как-то связано с магнитным полем земли
        и ещё кто-то предполагал что это может быть электромагнитными помехами от открытия серое но чёрт его знает

    self
        и как это связано с корруцистами

    moth
        понятия не имею ес честно
        просто знаю что когда значение уходит в минус,
        люди сообщают о головной боли или ошибках в визуализациях
        но ты не волнуйся, скорее всего оно безвредно
    
    RESPONSES::self
        окей<+>END
`)
env.localization.dialogues["++mothbeneath"] = generateDialogueObject(`
start
    sourceless
        за пределами твоего подключения обувь моли скребёт по бетону в панике
            EXEC::change("beneath", true)

    moth
        ебать
        ты в порядке? что ты там творишь?

____SHOWIF::"EXEC::env.pagePath == \`/local/beneath/parasite/\`"
    self
        всё нормально
        у меня просто получилось войти в игровую доску с паразитами

____SHOWIF::"EXEC::env.pagePath != \`/local/beneath/parasite/\` && env.pagePath != \`/local/ocean/ship/interview/\`"
    self
        всё нормально
        у меня просто получилось войти в мыслепространство через какие-то странные врата

____SHOWIF::"EXEC::env.pagePath == \`/local/ocean/ship/interview/\`"
    self
        всё нормально
        у меня просто получилось заново визуализировать интервью
____END

    moth
        втф
        и всё?
        окей, я не знаю как это работает
        может те "маски" как-то на это влияют кстати
            SHOWIF::['mask', 'hunger']
        но вообще ты щас не находишься ни в одном мыслепространстве
        тут все показания ёбнулись, выглядит так словно они считываются с нескольких мыслепространств одновременно
        у тебя визуализируется хоть что-нибудь?

    self
        да
        ты всё ещё видишь вывод?
    
    moth
        ну типа да, но он плавает в спаме из ошибок
        мыслеколы обычно отключаются с таким количеством бессвязности
        ...но ты, везунчик, работаешь на <span definition="ВНУТРЕННИЙ КОНТЕКСТ::'первый выпуск операционной системы мыслекола'">тонге</span> так ведь?
        всегда забываю это первая или третья
    
    self
        первая
    
    moth
        окей, точно, тогда скорее всего я знаю в чём дело
        помнишь про ту хрень с <span definition="ВНУТРЕННИЙ КОНТЕКСТ::'ранний скандал с мыслеколами';'полное удаление источника памяти во время визуализации с целью вызвать галлюцинации';'первые случаи временной несоосности'">извлечением памяти</span>?
        в тонге большую часть обработки выполняет твой мозг
        и хотя система не позволяет тебе визуализировать бессвязные штуки,
        когда ты входишь во что бы это ни было <em>из</em> уже довольно бессвязного места
        твой мозг как бы уже привык к бессвязности
        разница не была достаточно большой чтобы она сделала ещё одну проверку
        так что думаю ты типа получаешь сигналы от кусочков мыслеформ, плавающих вокруг
        тут скорее всего не будет много интересного
        но оглядеться всё же стоит
        дерзай, я пока попытаюсь отфильтровать всё со своей стороны
    
    RESPONSES::self
        ладно<+>END
`)


// this is actually from the hub
// but while we were testing it just REFUSED to load properly or something so you'd get english firstvisit when you got to the hub
// so we put it here
env.localization.dialogues["firstvisit"] = generateDialogueObject(`
start
    moth
        окей, я сейчас просматриваю логи...
        и я без понятия как тебе удалось пройти через этот авторизатор.
        или... почему они с тобой разговаривали как человек
        думаю мне не надо говорить насколько это необычно лол

    RESPONSES::self
        что-то помогло мне<+>something
        поговорим позже<+>END
            EXEC::setTimeout(()=> readoutAdd({message: "хорошо, я пока пороюсь в логах", name:"moth"}), 1000)

something
    self
        ТАМ ЧТО-ТО ПОЯВИЛОСЬ

    moth
        ага, я вижу как ты и авторизатор среагировали
        но не вижу, что это за "что-то". серьёзно, взгляни на логи
        не знаю, что и думать об этом. у корруцист бывают вирусы?
        но честно говоря это, скорее всего, просто бессвязность. не стоит опасаться, не то чтобы она может передаться тебе
        важно то, что ты внутри
        и если это правда сетевой соединитель, а не какая-то обесковая микроволновка...
        это <em>вообще</em> первый раз, когда нам удалось бы забраться в подобный
        поэтому сейчас я заткнусь и дам тебе делать своё дело. если есть вопросы - смело <span definition="ВНИМАНИЕ::'добавлен новый ярлык';'быстрый доступ через меню'">говори</span>

    RESPONSES::self
        к делу<+>END

END::env.hub.firstVisitEnd()
`)